<?php

$box = [
    [
        0 => 'Тетрадь',
        1 => 'Книга',
        2 => 'Настольная игра',
        3 => [
            'Настольная игра',
            'Настольная игра',
        ],
        4 => [
            [
                'Ноутбук',
                'Зарядное устройство'
            ],
            [
                'Компьютерная мышь',
                'Набор проводов',
                [
                    'Фотография',
                    'Картина'
                ]
            ],
            [
                'Инструкция',
                [
                    'Ключ'
                ]
            ]
        ]
    ],
    [
        0 => 'Пакет кошачьего корма',
        1 => [
            'Музыкальный плеер',
            'Книга'
        ]
    ]
];
//Ввод данных
$userItem = (string)readline('Какой предмет надо найти? ');

//Основная логика
function search (string $str, array $arr):bool
{
    foreach($arr as $item) {
        if (is_array($item)) {
            if(search($str, $item)){
                return true;
            }
        } elseif ($str === $item) {
            return true;
        }
    }
    return false;
}

//Вывод данных
echo search($userItem, $box) ? 'Найдено' : 'Не найдено';